package git;

public class Git {
/*
1.
        Нужно создаем на github репозиторий. Копируем SSH. Клонируем репозиторий git clone
2.
        Находясь в локальной папке исп команду git init.
        Дальше команды:
        - git add . - добавление всех файлов
        - git commit -m "Message" - изменения с коментарием
        - git push - файлы на github

3.
        Для загрузки изменений с github команда git pull

4.
        git status - показывает неотслеживаемые файлы
        git log - показывает список комитов, когда были изменения
        git remote -v - проверка связи репозитория с github

 */
    //очень опасный код что я написал и запушил для теста
}