/*
1.Как отказаться от изменений в файле (файлах) находящийся в рабочем каталоге (work directory)?
   Если в директории выполнена команда git add и файлы в директории отслеживаются,
   то мы можем откатывать изменения до последнего коммита git restore и даже восстанавливать
   удаленные в линукс файлы.

2.Как вернуть файл из индекса в рабочий каталог?


3.Как отменить ошибочный commit ?
    Правильно


        4.Как создать новую ветку и переключится в нее?
        5.В чем отличение между fast-forward merge  and non fast-forfard merge?
        6.Когда может возникнуть конфликт слияния веток, как  его разрешить?
        7.Можно ли удалить ветку? Как?

        В ответах на вопросы 1-4, 7 необходимо указать конкретные команда git.
        На 5 и 6 вопросы дать объяснение своими словами.

 */
