package javamain.hometask_reqex;

public class Task {
//    Напишите программу, которая запрашивает у пользователя строку и проверяет,
//    является ли эта строка действительным email-адресом.
//    Действительный email-адрес должен содержать символ "@",
//    доменное имя и доменное расширение (например, ".com" или ".org").
//    Используйте регулярное выражение для проверки email-адреса.
//
//    Напишите программу, которая запрашивает у пользователя строку
//    и проверяет, состоит ли эта строка только из букв и цифр.
//    Используйте регулярное выражение для проверки,
//    что в строке содержатся только символы латинского алфавита
//            (большие и/или маленькие) и цифры.
//
//    Напишите программу, которая запрашивает у пользователя строку
//    и проверяет, является ли эта строка действительным номером телефона.
//    Действительный номер телефона должен начинаться с символа "+"
//    и содержать девять цифр. Используйте регулярное выражение
//    для проверки номера телефона.
//
//    Напишите программу, которая запрашивает у пользователя строку
//    и заменяет все вхождения чисел в строке на слово "number".
//    Например, если строка содержит "12345", то программа должна
//    заменить это на "number". Используйте регулярное выражение
//    для поиска чисел в строке.
//
//    Напишите программу, которая запрашивает у пользователя строку
//    и проверяет, начинается ли эта строка с буквы "A" (большой или маленькой).
//    Используйте регулярное выражение для проверки начала строки.
//
//    Напишите программу, которая получает на вход текст и проверяет,
//    вхождения определенных строк в текст. Строки заданы в виде коллекции.
//    Используйте регулярное выражение для проверки текста.
//    Верните в качестве результата работы коллекцию из строк,
//    которые входят в текст.
}
