package algorythms.hometask.task11;

public class Task1_2 {
 /*
       1 уровень сложности: Task 1. Вы работаете в фирме по производству мебели и
       поставляете мебель по всей стране. Коробки с мебелью размещаются в грузовике.
       Все коробки имеют разный размер, и вы стараетесь наиболее эффективно
       использовать доступное пространство. Как выбрать коробки для того,
       чтобы загрузка имела максимальную эффективность? Предложите жадную стратегию.
       Будет ли полученное решение оптимальным?

       Task 2. Вы едете в отпуск, и у вас есть семь дней на знакомство с достопримечательностями.
       Вы присваиваете каждой достопримечательности стоимость в баллах (насколько вы хотите ее увидеть)
       и оцениваете продолжительность поездки. Как обеспечить максимальную стоимость
       (увидеть самое важное) во время поездки? Предложите жадную стратегию. Будет ли полученное
       решение оптимальным?
 */
}
